app/views/clearance_batches/index.html.erb

        <td><%= l(batch.created_at, format: :short) %></td>
        <td><%= batch.items.count %></td>
---
SELECT COUNT(*) FROM "items"  WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]