app/controllers/clearance_batches_controller.rb

SELECT "clearance_batches".* FROM "clearance_batches"
---
  def index
    @clearance_batches  = ClearanceBatch.all

INSERT INTO "clearance_batches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-12-16 22:38:48.497442"], ["updated_at", "2014-12-16 22:38:48.497442"]]
SELECT "items".* FROM "items"  WHERE "items"."status" = 'sellable' AND "items"."id" = 300
SELECT COUNT(*) FROM "items"  WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]
---
  def create

    clearancing_service = ClearancingService.new(uploaded_file)
    status = clearancing_service.process
    batch    = status.batch

    success_messages = []
    error_messages = []

    if status.counts[:success] > 0
      success_messages << "#{status.counts[:success]} items clearanced in batch #{batch.id}"
    else
      error_messages << "No new clearance batch was added"
    end

    if status.counts[:error] > 0
      error_messages << "#{status.counts[:error]} item ids raised errors and were not clearanced"
    end

    flash[:notice_2] = success_messages.join('<br/>') if success_messages.count > 0
    flash[:alert_2] = error_messages.join('<br/>') if error_messages.count > 0

    # to refactor

    alert_messages     = []
    if batch.persisted?
      flash[:notice]  = "#{batch.items.count} items clearanced in batch #{batch.id}"